Revit 2027 API
View3D.SetRenderingSettings Method
 Changes the rendering settings for this 3d view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetRenderingSettings(
	RenderingSettings settings
)
Public Sub SetRenderingSettings (
	settings As RenderingSettings
)
public:
void SetRenderingSettings(
	RenderingSettings^ settings
)
member SetRenderingSettings :
        settings : RenderingSettings -> unit
Parameters
settings RenderingSettings
 The new rendering settings to be applied to this view.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
View3D Class
Autodesk.Revit.DB Namespace